# 2. Напишите программу, которая принимает на вход число N
# и выдает набор произведений чисел от 1 до N.
# Пример:
# пусть N = 4, тогда [ 1, 2, 6, 24 ] (1, 12, 123, 1234)

from math import factorial # вызов модуля math и функции factorial
int = n(input('Введите N:'))
=result[] # создание списка от 1 до N
диапазон  в  i  для (1, n + 1):
    результат.добавить(i)
    
печать(* карта(факториал, результат)) #функция map (), которая позволяет применить 
                              #заданную функцию к каждому элементу 
                              # в итерируемом объекте (например, в 
                              # списке или словаре) и возвращает
                              # новый итератор для извлечения 
                              # результатов. 